# LineStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravel..::..LineStyle Property
PathOfTravel Class See Also
---
The line style of the path.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public ElementId LineStyle { get; set; }
```

Visual Basic
---
```text
Public Property LineStyle As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace